In [1]:

#import libraries
import pandas as pd
import sqlite3 as db

In [2]:
conn = db.connect('sqlite.db')

In [3]:
cn = conn.cursor() #execute statements to communicate with our database

In [5]:
cn.execute("CREATE TABLE employees (empid INTEGER PRIMARY KEY, firstname NVARCHAR(50), lastname NVARCHAR(50))") # creating a table

In [6]:
cn.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cn.fetchall())

[('employees',)]

In [7]:
cn.execute("INSERT INTO employees VALUES (1,'John','Doe')")
cn.execute("INSERT INTO employees VALUES (2,'Jason','Hale')")
cn.execute("INSERT INTO employees VALUES (3,'Sam','Billing')")

In [8]:
cn.execute("SELECT * FROM employees;")
print(cn.fetchall())

[(1, 'John', 'Doe'), (2, 'Jason', 'Hale'), (3, 'Sam', 'Billing')]

In [9]:
new_employees = [(4, 'Gustavo', 'Achong'),
 (5, 'Kim', 'Abercrombie'),
 (6, 'Pilar', 'Bernard'),
 (7, 'Frances', 'Adams'),
 (8, 'Margaret', 'Smith'),
 (9, 'Angela', 'Adams'),
 (10, 'Samuel', 'Agcaoili')]
cn.executemany('INSERT INTO employees VALUES (?, ?, ?)', new_employees)

In [10]:
cn.execute("SELECT * FROM employees;")
print(cn.fetchall())

[(1, 'John', 'Doe'), (2, 'Jason', 'Hale'), (3, 'Sam', 'Billing'), (4, 'Gustavo', 'Achong'), (5, 'Kim', 'Abercrombie'), (6, 'Pilar', 'Bernard'), (7, 'Frances', 'Adams'), (8, 'Margaret', 'Smith'), (9, 'Angela', 'Adams'), (10, 'Samuel', 'Agcaoili')]

In [11]:
conn.commit() #commiting changes with commit command so we wont lose the changes when you close the connection

In [12]:

cn.close()
conn.close() #close the cursor and the connection

In [13]:
con = db.connect('sqlite.db')
df_employees = pd.read_sql_query('select * from employees', con)

In [14]:

df_employees

   empid firstname     lastname
0      1      John          Doe
1      2     Jason         Hale
2      3       Sam      Billing
3      4   Gustavo       Achong
4      5       Kim  Abercrombie
5      6     Pilar      Bernard
6      7   Frances        Adams
7      8  Margaret        Smith
8      9    Angela        Adams
9     10    Samuel     Agcaoili

In [15]:
df_new = df_employees[:-1]

In [16]:
df_new

   empid firstname     lastname
0      1      John          Doe
1      2     Jason         Hale
2      3       Sam      Billing
3      4   Gustavo       Achong
4      5       Kim  Abercrombie
5      6     Pilar      Bernard
6      7   Frances        Adams
7      8  Margaret        Smith
8      9    Angela        Adams

In [17]:
df_new.to_sql("employees", con, if_exists="replace")

In [18]:
pd.read_sql_query ('select * from employees', con)

   index  empid firstname     lastname
0      0      1      John          Doe
1      1      2     Jason         Hale
2      2      3       Sam      Billing
3      3      4   Gustavo       Achong
4      4      5       Kim  Abercrombie
5      5      6     Pilar      Bernard
6      6      7   Frances        Adams
7      7      8  Margaret        Smith
8      8      9    Angela        Adams

In [19]:
con.close()